#language: ru

@tree
@БыстрыеПроверки

Функциональность: Проверка открытия регистров Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "AddProperties" 

	Дано Я открываю основную форму списка регистра сведений "AddProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AddProperties"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "AddProperties"

	Дано Я открываю основную форму регистра сведений "AddProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AddProperties"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "AttachedFiles" 

	Дано Я открываю основную форму списка регистра сведений "AttachedFiles"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AttachedFiles"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "AttachedFiles"

	Дано Я открываю основную форму регистра сведений "AttachedFiles"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AttachedFiles"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Barcodes" 

	Дано Я открываю основную форму списка регистра сведений "Barcodes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Barcodes"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Barcodes"

	Дано Я открываю основную форму регистра сведений "Barcodes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Barcodes"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "BarcodeScanInfoCheck" 

	Дано Я открываю основную форму списка регистра сведений "BarcodeScanInfoCheck"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BarcodeScanInfoCheck"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "BarcodeScanInfoCheck"

	Дано Я открываю основную форму регистра сведений "BarcodeScanInfoCheck"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BarcodeScanInfoCheck"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "BranchBankTerms" 

	Дано Я открываю основную форму списка регистра сведений "BranchBankTerms"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BranchBankTerms"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "BranchBankTerms"

	Дано Я открываю основную форму регистра сведений "BranchBankTerms"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BranchBankTerms"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "BundleContents" 

	Дано Я открываю основную форму списка регистра сведений "BundleContents"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BundleContents"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "BundleContents"

	Дано Я открываю основную форму регистра сведений "BundleContents"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BundleContents"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "CreatedProcurementOrders" 

	Дано Я открываю основную форму списка регистра сведений "CreatedProcurementOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CreatedProcurementOrders"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "CreatedProcurementOrders"

	Дано Я открываю основную форму регистра сведений "CreatedProcurementOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CreatedProcurementOrders"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "CurrencyRates" 

	Дано Я открываю основную форму списка регистра сведений "CurrencyRates"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CurrencyRates"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "CurrencyRates"

	Дано Я открываю основную форму регистра сведений "CurrencyRates"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CurrencyRates"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "DataMappingTable" 

	Дано Я открываю основную форму списка регистра сведений "DataMappingTable"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений DataMappingTable"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "DataMappingTable"

	Дано Я открываю основную форму регистра сведений "DataMappingTable"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений DataMappingTable"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ExternalCommands" 

	Дано Я открываю основную форму списка регистра сведений "ExternalCommands"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ExternalCommands"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ExternalCommands"

	Дано Я открываю основную форму регистра сведений "ExternalCommands"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ExternalCommands"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "IDInfo" 

	Дано Я открываю основную форму списка регистра сведений "IDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IDInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "IDInfo"

	Дано Я открываю основную форму регистра сведений "IDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IDInfo"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "IntegrationInfo" 

	Дано Я открываю основную форму списка регистра сведений "IntegrationInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IntegrationInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "IntegrationInfo"

	Дано Я открываю основную форму регистра сведений "IntegrationInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IntegrationInfo"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ItemSegments" 

	Дано Я открываю основную форму списка регистра сведений "ItemSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ItemSegments"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ItemSegments"

	Дано Я открываю основную форму регистра сведений "ItemSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ItemSegments"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "LockDataModificationRules" 

	Дано Я открываю основную форму списка регистра сведений "LockDataModificationRules"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений LockDataModificationRules"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "LockDataModificationRules"

	Дано Я открываю основную форму регистра сведений "LockDataModificationRules"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений LockDataModificationRules"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ObjectStatuses" 

	Дано Я открываю основную форму списка регистра сведений "ObjectStatuses"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ObjectStatuses"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ObjectStatuses"

	Дано Я открываю основную форму регистра сведений "ObjectStatuses"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ObjectStatuses"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PartnerSegments" 

	Дано Я открываю основную форму списка регистра сведений "PartnerSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PartnerSegments"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PartnerSegments"

	Дано Я открываю основную форму регистра сведений "PartnerSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PartnerSegments"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PricesByItemKeys" 

	Дано Я открываю основную форму списка регистра сведений "PricesByItemKeys"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItemKeys"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PricesByItemKeys"

	Дано Я открываю основную форму регистра сведений "PricesByItemKeys"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItemKeys"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PricesByItems" 

	Дано Я открываю основную форму списка регистра сведений "PricesByItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItems"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PricesByItems"

	Дано Я открываю основную форму регистра сведений "PricesByItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItems"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PricesByProperties" 

	Дано Я открываю основную форму списка регистра сведений "PricesByProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByProperties"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PricesByProperties"

	Дано Я открываю основную форму регистра сведений "PricesByProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByProperties"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "RemainingItemsInfo" 

	Дано Я открываю основную форму списка регистра сведений "RemainingItemsInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений RemainingItemsInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "RemainingItemsInfo"

	Дано Я открываю основную форму регистра сведений "RemainingItemsInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений RemainingItemsInfo"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "SavedItems" 

	Дано Я открываю основную форму списка регистра сведений "SavedItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SavedItems"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "SavedItems"

	Дано Я открываю основную форму регистра сведений "SavedItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SavedItems"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "SharedReportOptions" 

	Дано Я открываю основную форму списка регистра сведений "SharedReportOptions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SharedReportOptions"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "SharedReportOptions"

	Дано Я открываю основную форму регистра сведений "SharedReportOptions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SharedReportOptions"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T1010S_ScannedBarcode" 

	Дано Я открываю основную форму списка регистра сведений "T1010S_ScannedBarcode"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T1010S_ScannedBarcode"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T1010S_ScannedBarcode"

	Дано Я открываю основную форму регистра сведений "T1010S_ScannedBarcode"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T1010S_ScannedBarcode"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2010S_OffsetOfAdvances" 

	Дано Я открываю основную форму списка регистра сведений "T2010S_OffsetOfAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2010S_OffsetOfAdvances"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2010S_OffsetOfAdvances"

	Дано Я открываю основную форму регистра сведений "T2010S_OffsetOfAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2010S_OffsetOfAdvances"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2011S_PartnerTransactions" 

	Дано Я открываю основную форму списка регистра сведений "T2011S_PartnerTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2011S_PartnerTransactions"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2011S_PartnerTransactions"

	Дано Я открываю основную форму регистра сведений "T2011S_PartnerTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2011S_PartnerTransactions"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2012S_PartnerAdvances" 

	Дано Я открываю основную форму списка регистра сведений "T2012S_PartnerAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2012S_PartnerAdvances"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2012S_PartnerAdvances"

	Дано Я открываю основную форму регистра сведений "T2012S_PartnerAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2012S_PartnerAdvances"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2013S_OffsetOfAging" 

	Дано Я открываю основную форму списка регистра сведений "T2013S_OffsetOfAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2013S_OffsetOfAging"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2013S_OffsetOfAging"

	Дано Я открываю основную форму регистра сведений "T2013S_OffsetOfAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2013S_OffsetOfAging"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Taxes" 

	Дано Я открываю основную форму списка регистра сведений "Taxes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Taxes"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Taxes"

	Дано Я открываю основную форму регистра сведений "Taxes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Taxes"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "TaxSettings" 

	Дано Я открываю основную форму списка регистра сведений "TaxSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений TaxSettings"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "TaxSettings"

	Дано Я открываю основную форму регистра сведений "TaxSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений TaxSettings"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "UserSettings" 

	Дано Я открываю основную форму списка регистра сведений "UserSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений UserSettings"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "UserSettings"

	Дано Я открываю основную форму регистра сведений "UserSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений UserSettings"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T3010S_RowIDInfo" 

	Дано Я открываю основную форму списка регистра сведений "T3010S_RowIDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T3010S_RowIDInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T3010S_RowIDInfo"

	Дано Я открываю основную форму регистра сведений "T3010S_RowIDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T3010S_RowIDInfo"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "CashInTransit" 

	Дано Я открываю основную форму списка регистра накопления "CashInTransit"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления CashInTransit"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "CashInTransit"

	Дано Я открываю основную форму регистра накопления "CashInTransit"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления CashInTransit"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1001T_Purchases" 

	Дано Я открываю основную форму списка регистра накопления "R1001T_Purchases"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1001T_Purchases"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1001T_Purchases"

	Дано Я открываю основную форму регистра накопления "R1001T_Purchases"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1001T_Purchases"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1002T_PurchaseReturns" 

	Дано Я открываю основную форму списка регистра накопления "R1002T_PurchaseReturns"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1002T_PurchaseReturns"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1002T_PurchaseReturns"

	Дано Я открываю основную форму регистра накопления "R1002T_PurchaseReturns"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1002T_PurchaseReturns"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1005T_PurchaseSpecialOffers" 

	Дано Я открываю основную форму списка регистра накопления "R1005T_PurchaseSpecialOffers"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1005T_PurchaseSpecialOffers"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1005T_PurchaseSpecialOffers"

	Дано Я открываю основную форму регистра накопления "R1005T_PurchaseSpecialOffers"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1005T_PurchaseSpecialOffers"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1010T_PurchaseOrders" 

	Дано Я открываю основную форму списка регистра накопления "R1010T_PurchaseOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1010T_PurchaseOrders"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1010T_PurchaseOrders"

	Дано Я открываю основную форму регистра накопления "R1010T_PurchaseOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1010T_PurchaseOrders"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1011B_PurchaseOrdersReceipt" 

	Дано Я открываю основную форму списка регистра накопления "R1011B_PurchaseOrdersReceipt"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1011B_PurchaseOrdersReceipt"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1011B_PurchaseOrdersReceipt"

	Дано Я открываю основную форму регистра накопления "R1011B_PurchaseOrdersReceipt"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1011B_PurchaseOrdersReceipt"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1012B_PurchaseOrdersInvoiceClosing" 

	Дано Я открываю основную форму списка регистра накопления "R1012B_PurchaseOrdersInvoiceClosing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1012B_PurchaseOrdersInvoiceClosing"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1012B_PurchaseOrdersInvoiceClosing"

	Дано Я открываю основную форму регистра накопления "R1012B_PurchaseOrdersInvoiceClosing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1012B_PurchaseOrdersInvoiceClosing"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1014T_CanceledPurchaseOrders" 

	Дано Я открываю основную форму списка регистра накопления "R1014T_CanceledPurchaseOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1014T_CanceledPurchaseOrders"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1014T_CanceledPurchaseOrders"

	Дано Я открываю основную форму регистра накопления "R1014T_CanceledPurchaseOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1014T_CanceledPurchaseOrders"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1020B_AdvancesToVendors" 

	Дано Я открываю основную форму списка регистра накопления "R1020B_AdvancesToVendors"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1020B_AdvancesToVendors"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1020B_AdvancesToVendors"

	Дано Я открываю основную форму регистра накопления "R1020B_AdvancesToVendors"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1020B_AdvancesToVendors"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1021B_VendorsTransactions" 

	Дано Я открываю основную форму списка регистра накопления "R1021B_VendorsTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1021B_VendorsTransactions"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1021B_VendorsTransactions"

	Дано Я открываю основную форму регистра накопления "R1021B_VendorsTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1021B_VendorsTransactions"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1022B_VendorsPaymentPlanning" 

	Дано Я открываю основную форму списка регистра накопления "R1022B_VendorsPaymentPlanning"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1022B_VendorsPaymentPlanning"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1022B_VendorsPaymentPlanning"

	Дано Я открываю основную форму регистра накопления "R1022B_VendorsPaymentPlanning"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1022B_VendorsPaymentPlanning"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1031B_ReceiptInvoicing" 

	Дано Я открываю основную форму списка регистра накопления "R1031B_ReceiptInvoicing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1031B_ReceiptInvoicing"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1031B_ReceiptInvoicing"

	Дано Я открываю основную форму регистра накопления "R1031B_ReceiptInvoicing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1031B_ReceiptInvoicing"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R1040B_TaxesOutgoing" 

	Дано Я открываю основную форму списка регистра накопления "R1040B_TaxesOutgoing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1040B_TaxesOutgoing"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R1040B_TaxesOutgoing"

	Дано Я открываю основную форму регистра накопления "R1040B_TaxesOutgoing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R1040B_TaxesOutgoing"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2001T_Sales" 

	Дано Я открываю основную форму списка регистра накопления "R2001T_Sales"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2001T_Sales"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2001T_Sales"

	Дано Я открываю основную форму регистра накопления "R2001T_Sales"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2001T_Sales"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2002T_SalesReturns" 

	Дано Я открываю основную форму списка регистра накопления "R2002T_SalesReturns"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2002T_SalesReturns"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2002T_SalesReturns"

	Дано Я открываю основную форму регистра накопления "R2002T_SalesReturns"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2002T_SalesReturns"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2005T_SalesSpecialOffers" 

	Дано Я открываю основную форму списка регистра накопления "R2005T_SalesSpecialOffers"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2005T_SalesSpecialOffers"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2005T_SalesSpecialOffers"

	Дано Я открываю основную форму регистра накопления "R2005T_SalesSpecialOffers"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2005T_SalesSpecialOffers"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2010T_SalesOrders" 

	Дано Я открываю основную форму списка регистра накопления "R2010T_SalesOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2010T_SalesOrders"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2010T_SalesOrders"

	Дано Я открываю основную форму регистра накопления "R2010T_SalesOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2010T_SalesOrders"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2011B_SalesOrdersShipment" 

	Дано Я открываю основную форму списка регистра накопления "R2011B_SalesOrdersShipment"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2011B_SalesOrdersShipment"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2011B_SalesOrdersShipment"

	Дано Я открываю основную форму регистра накопления "R2011B_SalesOrdersShipment"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2011B_SalesOrdersShipment"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2012B_SalesOrdersInvoiceClosing" 

	Дано Я открываю основную форму списка регистра накопления "R2012B_SalesOrdersInvoiceClosing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2012B_SalesOrdersInvoiceClosing"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2012B_SalesOrdersInvoiceClosing"

	Дано Я открываю основную форму регистра накопления "R2012B_SalesOrdersInvoiceClosing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2012B_SalesOrdersInvoiceClosing"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2013T_SalesOrdersProcurement" 

	Дано Я открываю основную форму списка регистра накопления "R2013T_SalesOrdersProcurement"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2013T_SalesOrdersProcurement"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2013T_SalesOrdersProcurement"

	Дано Я открываю основную форму регистра накопления "R2013T_SalesOrdersProcurement"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2013T_SalesOrdersProcurement"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2014T_CanceledSalesOrders" 

	Дано Я открываю основную форму списка регистра накопления "R2014T_CanceledSalesOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2014T_CanceledSalesOrders"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2014T_CanceledSalesOrders"

	Дано Я открываю основную форму регистра накопления "R2014T_CanceledSalesOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2014T_CanceledSalesOrders"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2020B_AdvancesFromCustomers" 

	Дано Я открываю основную форму списка регистра накопления "R2020B_AdvancesFromCustomers"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2020B_AdvancesFromCustomers"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2020B_AdvancesFromCustomers"

	Дано Я открываю основную форму регистра накопления "R2020B_AdvancesFromCustomers"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2020B_AdvancesFromCustomers"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2021B_CustomersTransactions" 

	Дано Я открываю основную форму списка регистра накопления "R2021B_CustomersTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2021B_CustomersTransactions"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2021B_CustomersTransactions"

	Дано Я открываю основную форму регистра накопления "R2021B_CustomersTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2021B_CustomersTransactions"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2022B_CustomersPaymentPlanning" 

	Дано Я открываю основную форму списка регистра накопления "R2022B_CustomersPaymentPlanning"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2022B_CustomersPaymentPlanning"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2022B_CustomersPaymentPlanning"

	Дано Я открываю основную форму регистра накопления "R2022B_CustomersPaymentPlanning"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2022B_CustomersPaymentPlanning"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2031B_ShipmentInvoicing" 

	Дано Я открываю основную форму списка регистра накопления "R2031B_ShipmentInvoicing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2031B_ShipmentInvoicing"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2031B_ShipmentInvoicing"

	Дано Я открываю основную форму регистра накопления "R2031B_ShipmentInvoicing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2031B_ShipmentInvoicing"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2040B_TaxesIncoming" 

	Дано Я открываю основную форму списка регистра накопления "R2040B_TaxesIncoming"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2040B_TaxesIncoming"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2040B_TaxesIncoming"

	Дано Я открываю основную форму регистра накопления "R2040B_TaxesIncoming"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2040B_TaxesIncoming"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R2050T_RetailSales" 

	Дано Я открываю основную форму списка регистра накопления "R2050T_RetailSales"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2050T_RetailSales"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R2050T_RetailSales"

	Дано Я открываю основную форму регистра накопления "R2050T_RetailSales"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R2050T_RetailSales"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3010B_CashOnHand" 

	Дано Я открываю основную форму списка регистра накопления "R3010B_CashOnHand"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3010B_CashOnHand"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3010B_CashOnHand"

	Дано Я открываю основную форму регистра накопления "R3010B_CashOnHand"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3010B_CashOnHand"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3011T_CashMovements" 

	Дано Я открываю основную форму списка регистра накопления "R3011T_CashMovements"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3011T_CashMovements"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3011T_CashMovements"

	Дано Я открываю основную форму регистра накопления "R3011T_CashMovements"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3011T_CashMovements"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3015B_CashAdvance" 

	Дано Я открываю основную форму списка регистра накопления "R3015B_CashAdvance"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3015B_CashAdvance"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3015B_CashAdvance"

	Дано Я открываю основную форму регистра накопления "R3015B_CashAdvance"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3015B_CashAdvance"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3016B_ChequeAndBonds" 

	Дано Я открываю основную форму списка регистра накопления "R3016B_ChequeAndBonds"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3016B_ChequeAndBonds"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3016B_ChequeAndBonds"

	Дано Я открываю основную форму регистра накопления "R3016B_ChequeAndBonds"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3016B_ChequeAndBonds"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3021B_CashInTransitIncoming" 

	Дано Я открываю основную форму списка регистра накопления "R3021B_CashInTransitIncoming"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3021B_CashInTransitIncoming"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3021B_CashInTransitIncoming"

	Дано Я открываю основную форму регистра накопления "R3021B_CashInTransitIncoming"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3021B_CashInTransitIncoming"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3022B_CashInTransitOutgoing" 

	Дано Я открываю основную форму списка регистра накопления "R3022B_CashInTransitOutgoing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3022B_CashInTransitOutgoing"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3022B_CashInTransitOutgoing"

	Дано Я открываю основную форму регистра накопления "R3022B_CashInTransitOutgoing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3022B_CashInTransitOutgoing"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3035T_CashPlanning" 

	Дано Я открываю основную форму списка регистра накопления "R3035T_CashPlanning"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3035T_CashPlanning"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3035T_CashPlanning"

	Дано Я открываю основную форму регистра накопления "R3035T_CashPlanning"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3035T_CashPlanning"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R3050T_RetailCash" 

	Дано Я открываю основную форму списка регистра накопления "R3050T_RetailCash"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3050T_RetailCash"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R3050T_RetailCash"

	Дано Я открываю основную форму регистра накопления "R3050T_RetailCash"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R3050T_RetailCash"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4010B_ActualStocks" 

	Дано Я открываю основную форму списка регистра накопления "R4010B_ActualStocks"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4010B_ActualStocks"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4010B_ActualStocks"

	Дано Я открываю основную форму регистра накопления "R4010B_ActualStocks"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4010B_ActualStocks"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4011B_FreeStocks" 

	Дано Я открываю основную форму списка регистра накопления "R4011B_FreeStocks"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4011B_FreeStocks"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4011B_FreeStocks"

	Дано Я открываю основную форму регистра накопления "R4011B_FreeStocks"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4011B_FreeStocks"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4012B_StockReservation" 

	Дано Я открываю основную форму списка регистра накопления "R4012B_StockReservation"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4012B_StockReservation"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4012B_StockReservation"

	Дано Я открываю основную форму регистра накопления "R4012B_StockReservation"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4012B_StockReservation"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4014B_SerialLotNumber" 

	Дано Я открываю основную форму списка регистра накопления "R4014B_SerialLotNumber"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4014B_SerialLotNumber"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4014B_SerialLotNumber"

	Дано Я открываю основную форму регистра накопления "R4014B_SerialLotNumber"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4014B_SerialLotNumber"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4015T_InternalSupplyRequests" 

	Дано Я открываю основную форму списка регистра накопления "R4015T_InternalSupplyRequests"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4015T_InternalSupplyRequests"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4015T_InternalSupplyRequests"

	Дано Я открываю основную форму регистра накопления "R4015T_InternalSupplyRequests"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4015T_InternalSupplyRequests"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4016B_InternalSupplyRequestOrdering" 

	Дано Я открываю основную форму списка регистра накопления "R4016B_InternalSupplyRequestOrdering"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4016B_InternalSupplyRequestOrdering"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4016B_InternalSupplyRequestOrdering"

	Дано Я открываю основную форму регистра накопления "R4016B_InternalSupplyRequestOrdering"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4016B_InternalSupplyRequestOrdering"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4017B_InternalSupplyRequestProcurement" 

	Дано Я открываю основную форму списка регистра накопления "R4017B_InternalSupplyRequestProcurement"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4017B_InternalSupplyRequestProcurement"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4017B_InternalSupplyRequestProcurement"

	Дано Я открываю основную форму регистра накопления "R4017B_InternalSupplyRequestProcurement"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4017B_InternalSupplyRequestProcurement"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4020T_StockTransferOrders" 

	Дано Я открываю основную форму списка регистра накопления "R4020T_StockTransferOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4020T_StockTransferOrders"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4020T_StockTransferOrders"

	Дано Я открываю основную форму регистра накопления "R4020T_StockTransferOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4020T_StockTransferOrders"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4021B_StockTransferOrdersReceipt" 

	Дано Я открываю основную форму списка регистра накопления "R4021B_StockTransferOrdersReceipt"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4021B_StockTransferOrdersReceipt"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4021B_StockTransferOrdersReceipt"

	Дано Я открываю основную форму регистра накопления "R4021B_StockTransferOrdersReceipt"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4021B_StockTransferOrdersReceipt"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4022B_StockTransferOrdersShipment" 

	Дано Я открываю основную форму списка регистра накопления "R4022B_StockTransferOrdersShipment"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4022B_StockTransferOrdersShipment"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4022B_StockTransferOrdersShipment"

	Дано Я открываю основную форму регистра накопления "R4022B_StockTransferOrdersShipment"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4022B_StockTransferOrdersShipment"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4031B_GoodsInTransitIncoming" 

	Дано Я открываю основную форму списка регистра накопления "R4031B_GoodsInTransitIncoming"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4031B_GoodsInTransitIncoming"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4031B_GoodsInTransitIncoming"

	Дано Я открываю основную форму регистра накопления "R4031B_GoodsInTransitIncoming"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4031B_GoodsInTransitIncoming"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4032B_GoodsInTransitOutgoing" 

	Дано Я открываю основную форму списка регистра накопления "R4032B_GoodsInTransitOutgoing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4032B_GoodsInTransitOutgoing"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4032B_GoodsInTransitOutgoing"

	Дано Я открываю основную форму регистра накопления "R4032B_GoodsInTransitOutgoing"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4032B_GoodsInTransitOutgoing"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4033B_GoodsReceiptSchedule" 

	Дано Я открываю основную форму списка регистра накопления "R4033B_GoodsReceiptSchedule"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4033B_GoodsReceiptSchedule"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4033B_GoodsReceiptSchedule"

	Дано Я открываю основную форму регистра накопления "R4033B_GoodsReceiptSchedule"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4033B_GoodsReceiptSchedule"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4034B_GoodsShipmentSchedule" 

	Дано Я открываю основную форму списка регистра накопления "R4034B_GoodsShipmentSchedule"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4034B_GoodsShipmentSchedule"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4034B_GoodsShipmentSchedule"

	Дано Я открываю основную форму регистра накопления "R4034B_GoodsShipmentSchedule"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4034B_GoodsShipmentSchedule"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4035B_IncomingStocks" 

	Дано Я открываю основную форму списка регистра накопления "R4035B_IncomingStocks"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4035B_IncomingStocks"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4035B_IncomingStocks"

	Дано Я открываю основную форму регистра накопления "R4035B_IncomingStocks"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4035B_IncomingStocks"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4036B_IncomingStocksRequested" 

	Дано Я открываю основную форму списка регистра накопления "R4036B_IncomingStocksRequested"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4036B_IncomingStocksRequested"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4036B_IncomingStocksRequested"

	Дано Я открываю основную форму регистра накопления "R4036B_IncomingStocksRequested"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4036B_IncomingStocksRequested"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4050B_StockInventory" 

	Дано Я открываю основную форму списка регистра накопления "R4050B_StockInventory"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4050B_StockInventory"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4050B_StockInventory"

	Дано Я открываю основную форму регистра накопления "R4050B_StockInventory"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4050B_StockInventory"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4051T_StockAdjustmentAsWriteOff" 

	Дано Я открываю основную форму списка регистра накопления "R4051T_StockAdjustmentAsWriteOff"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4051T_StockAdjustmentAsWriteOff"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4051T_StockAdjustmentAsWriteOff"

	Дано Я открываю основную форму регистра накопления "R4051T_StockAdjustmentAsWriteOff"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4051T_StockAdjustmentAsWriteOff"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4052T_StockAdjustmentAsSurplus" 

	Дано Я открываю основную форму списка регистра накопления "R4052T_StockAdjustmentAsSurplus"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4052T_StockAdjustmentAsSurplus"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4052T_StockAdjustmentAsSurplus"

	Дано Я открываю основную форму регистра накопления "R4052T_StockAdjustmentAsSurplus"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4052T_StockAdjustmentAsSurplus"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R5010B_ReconciliationStatement" 

	Дано Я открываю основную форму списка регистра накопления "R5010B_ReconciliationStatement"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5010B_ReconciliationStatement"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R5010B_ReconciliationStatement"

	Дано Я открываю основную форму регистра накопления "R5010B_ReconciliationStatement"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5010B_ReconciliationStatement"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R5011B_CustomersAging" 

	Дано Я открываю основную форму списка регистра накопления "R5011B_CustomersAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5011B_CustomersAging"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R5011B_CustomersAging"

	Дано Я открываю основную форму регистра накопления "R5011B_CustomersAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5011B_CustomersAging"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R5012B_VendorsAging" 

	Дано Я открываю основную форму списка регистра накопления "R5012B_VendorsAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5012B_VendorsAging"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R5012B_VendorsAging"

	Дано Я открываю основную форму регистра накопления "R5012B_VendorsAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5012B_VendorsAging"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R5021T_Revenues" 

	Дано Я открываю основную форму списка регистра накопления "R5021T_Revenues"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5021T_Revenues"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R5021T_Revenues"

	Дано Я открываю основную форму регистра накопления "R5021T_Revenues"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5021T_Revenues"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R5022T_Expenses" 

	Дано Я открываю основную форму списка регистра накопления "R5022T_Expenses"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5022T_Expenses"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R5022T_Expenses"

	Дано Я открываю основную форму регистра накопления "R5022T_Expenses"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5022T_Expenses"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R5041B_TaxesPayable" 

	Дано Я открываю основную форму списка регистра накопления "R5041B_TaxesPayable"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5041B_TaxesPayable"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R5041B_TaxesPayable"

	Дано Я открываю основную форму регистра накопления "R5041B_TaxesPayable"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R5041B_TaxesPayable"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "TM1010B_RowIDMovements" 

	Дано Я открываю основную форму списка регистра накопления "TM1010B_RowIDMovements"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления TM1010B_RowIDMovements"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "TM1010B_RowIDMovements"

	Дано Я открываю основную форму регистра накопления "TM1010B_RowIDMovements"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления TM1010B_RowIDMovements"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "TM1010T_RowIDMovements" 

	Дано Я открываю основную форму списка регистра накопления "TM1010T_RowIDMovements"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления TM1010T_RowIDMovements"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "TM1010T_RowIDMovements"

	Дано Я открываю основную форму регистра накопления "TM1010T_RowIDMovements"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления TM1010T_RowIDMovements"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "R4037B_PlannedReceiptReservationRequests" 

	Дано Я открываю основную форму списка регистра накопления "R4037B_PlannedReceiptReservationRequests"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4037B_PlannedReceiptReservationRequests"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "R4037B_PlannedReceiptReservationRequests"

	Дано Я открываю основную форму регистра накопления "R4037B_PlannedReceiptReservationRequests"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления R4037B_PlannedReceiptReservationRequests"
	И Я закрываю текущее окно

